public_html/articles/cl/lispfeatures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Особенности Common Lisp.</title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title">Особенности Common Lisp.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Синтаксис</a></li>
<li><a href="#sec-2">2. Арифметика</a></li>
<li><a href="#sec-3">3. Places</a></li>
<li><a href="#sec-4">4. Множественные значения</a></li>
<li><a href="#sec-5">5. Макросы</a></li>
<li><a href="#sec-6">6. Функции как сущности первого класса</a></li>
<li><a href="#sec-7">7. Анонимные функции и лексические замыкания</a></li>
<li><a href="#sec-8">8. Необязательные и именованные параметры</a></li>
</ul>
</div>
</div>
<p>
О намерениях. Данная компиляция не стремиться убедить вас использовать Common Lisp. Не хотите -
не используйте. Нам же лучше. Адресовано в большей степени программистом, которые хотят понять,
что в лиспе есть такого, чего нет в других языках. Буду теперь посылать их всех сюда.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Синтаксис</h2>
<div class="outline-text-2" id="text-1">
<p>
Он отличается компактностью: то что вы пишете как
</p>

<p>
&lt;source lang=""&gt;
function add(x, y) {
  return x+y;
}
&lt;/source&gt;
</p>

<p>
в Common Lisp записывается как
</p>

<p>
&lt;source lang=""&gt;
(defun add (x y)
  (+ x y))
&lt;/source&gt;
</p>

<p>
Такая запись поощряет метапрограммирование.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Арифметика</h2>
<div class="outline-text-2" id="text-2">
<p>
(+ 5/9 3/4) будет равно 47/36 а не 1.30555556
</p>

<p>
Это позволяет избегать многих ошибок округления. Разрядная сетка увеличивается автоматически.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Places</h2>
<div class="outline-text-2" id="text-3">
<p>
Forms и places можно рассматривать как если бы они были конкретными, изменяемыми переменные и
присваивать им значения. Проиллюстрирую это на алгол-подобном языке:
</p>

<p>
&lt;source lang=""&gt;
a = ['red' 'green' 'blue'];
first(a); // выведет 'red'
first(a) = 'yellow';
first(a); // теперь выведет 'yellow'
&lt;/source&gt;
</p>

<p>
На лиспе это записывается так:
</p>

<p>
&lt;source lang=""&gt;
(defvar <b>colours</b> (list "red" "green" "blue"))
(first <b>colours</b>) ;; выведет "red"
(setf (first <b>colours</b>) "yellow")
(first <b>colours</b>) ;; выведет "yellow"
&lt;/source&gt;
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Множественные значения</h2>
<div class="outline-text-2" id="text-4">
<p>
Изучая ассемблер, в частности соглашения о вызовах си-функций, я недоумевал - кто это решил,
что функция должна возвращать только одно значение? Никаких аппаратных ограничений на это ведь
нет. В Common Lisp функция может возвращать сколько угодно значений. В переводе на
алгол-подобный язык это было бы так:
</p>

<p>
&lt;source lang=""&gt;
func(param) {
  return (param*3) (param*6)
}
</p>

<p>
a, b = func(5)
&lt;/source&gt;
</p>

<p>
а на Common Lisp это будет вот так:
</p>

<p>
&lt;source lang=""&gt;
(defun func (param)
(values (* 3 param) (* 6 param)))
</p>

<p>
(multiple-value-bind (a b)
(func 5))
&lt;/source&gt;
</p>

<p>
Теперь не нужно строить структуру данных, когда вы просто хотите возвратить чуточку больше чем
собирались ранее.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Макросы</h2>
<div class="outline-text-2" id="text-5">
<p>
Макрос в Common Lisp это функция, возвращающая код, который после возврата будет немедленно
скомпилирован и исполнен в контексте вызова макроса. Думаю не нужно объяснять, какие
возможности это открывает при умелом применении для метапрограммирования.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Функции как сущности первого класса</h2>
<div class="outline-text-2" id="text-6">
<p>
На практике это означает, что можно создавать функции динамически, передавать их в качестве
аргументов и возвращать их из других функций. Экономит кучу времени и ресурсов мышления.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Анонимные функции и лексические замыкания</h2>
<div class="outline-text-2" id="text-7">
<p>
Это функции без имени, объявленные и использованные в контексте объявления. Например вот так
мог бы выглядеть некий вызвов функции сортировки слов, где мы создаем анонимную функцию, прямо
в контексте вызова, которая возвращает true или false в зависимости от результата сравнения a
и b:
</p>

<p>
&lt;source lang=""&gt;
sort<sub>words</sub>("one two alfa beta", create<sub>function</sub>(a, b) {&#x2026;});
&lt;/source&gt;
</p>

<p>
А на лиспе это еще проще:
</p>

<p>
&lt;source lang=""&gt;
 (sort-words "one two alfa beta"
 (lambda (a b)
 &#x2026;))
&lt;/source&gt;
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Необязательные и именованные параметры</h2>
<div class="outline-text-2" id="text-8">
<p>
 Вы можете использовать не только необязательные параметры в своих функциях, но и именованные
параметры, как если бы вы писали так:
</p>

<p>
&lt;source lang=""&gt;
 func(a, b="default value", с:key="alfa") { &#x2026; }
&lt;/source&gt;
</p>

<p>
Здесь a - обязательный параметр, b - необязательный, а c - именованный. Если вы вызовете
функцию так:
</p>

<p>
&lt;source lang=""&gt;
 func(1, key:2);
&lt;/source&gt;
</p>

<p>
то внутри функции a будет равно 1, b - "default value", а c - 2. На лиспе это будет выглядеть
вот так:
</p>

<p>
&lt;source lang=""&gt;
(defun func (a &amp;optional b &amp;key (key "alfa"))
&#x2026;)
&lt;/source&gt;
</p>

<p>
Указывать значения по умолчанию для ключевых параметров необязательно. Вы так же можете
создавать функци и с неопределенным количеством параметров, добавляя модификатор &amp;rest - все
параметры сверх попадут в него:
</p>

<p>
&lt;source lang=""&gt;
(defun func (a &amp;optional b &amp;key (key "alfa") &amp;rest other-args)
&#x2026;)
&lt;/source&gt;
</p>

<p>
Использование ключевых параметров повышает читабельность, сравните эти два вызова:
</p>

<p>
&lt;source lang=""&gt;
(xf86InitValuatorAxisStruct device, 0, 0, -1, 1, 0, 1))
&lt;/source&gt;
</p>

<p>
и
</p>

<p>
&lt;source lang=""&gt;
(xf86-init-valuator-axis-struct :dev device :ax-num 0
:min-val 0 :max-val -1
:min-res 0 :max-res 1
:resolution 1)
&lt;/source&gt;
</p>


<p>
Многое еще осталось неупомянутым, но сегодня я уже не нахожу в себе силы закончить. Продолжение
следует, а самые нетерпеливые могут обратиться к первоисточнику &lt;a href="<a href="http://abhishek.geek.nz/docs/features-of-common-lisp">http://abhishek.geek.nz/docs/features-of-common-lisp</a>"&gt;тут&lt;/a&gt;.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
